In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv('/home/nikita/PycharmProjects/natural_language/data/train.csv')
data.head()

/home/nikita/anaconda3/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2728: DtypeWarning: Columns (0) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,Unnamed: 0,stars,text,useful,funny,funny.1
0,4654937,4,3 words: $10 mimosa pitcher!!! I believe we we...,0.0,0.0,0.0
1,3329981,3,"First off, I must say the food, sangria and se...",0.0,0.0,0.0
2,433463,5,I have been there 3 times for 3 different vehi...,0.0,0.0,0.0
3,4733336,5,Ate breakfast there yesterday. The corned beef...,0.0,0.0,0.0
4,1732165,4,I love Greek food and judge greek restaurants ...,1.0,0.0,0.0

In [3]:
data = data.drop(['Unnamed: 0', 'funny.1'], axis=1)
data.head()

   stars                                               text  useful  funny
0      4  3 words: $10 mimosa pitcher!!! I believe we we...     0.0    0.0
1      3  First off, I must say the food, sangria and se...     0.0    0.0
2      5  I have been there 3 times for 3 different vehi...     0.0    0.0
3      5  Ate breakfast there yesterday. The corned beef...     0.0    0.0
4      4  I love Greek food and judge greek restaurants ...     1.0    0.0

In [10]:
data[ (data.funny > 0 )] = 1
data[ (data.funny == 0 )] = 0
data.funny.value_counts()

0.0    3304452
1.0     904880
Name: funny, dtype: int64